; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_2)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 - link
    angle0 angle20 angle40 angle60 angle80 angle100 angle120 angle140 angle160 angle180 angle200 angle220 angle240 angle260 angle280 angle300 angle320 angle340 - angle)
(:init
    (AngleOrd angle0 angle20)
    (AngleOrd angle20 angle40)
    (AngleOrd angle40 angle60)
    (AngleOrd angle60 angle80)
    (AngleOrd angle80 angle100)
    (AngleOrd angle100 angle120)
    (AngleOrd angle120 angle140)
    (AngleOrd angle140 angle160)
    (AngleOrd angle160 angle180)
    (AngleOrd angle180 angle200)
    (AngleOrd angle200 angle220)
    (AngleOrd angle220 angle240)
    (AngleOrd angle240 angle260)
    (AngleOrd angle260 angle280)
    (AngleOrd angle280 angle300)
    (AngleOrd angle300 angle320)
    (AngleOrd angle320 angle340)
    (AngleOrd angle340 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)
    (Affected link5 link1)
    (Affected link5 link2)
    (Affected link5 link3)
    (Affected link5 link4)

    (HasAngle angle120 link1)
    (HasAngle angle220 link2)
    (HasAngle angle140 link3)
    (HasAngle angle300 link4)
    (HasAngle angle320 link5)
)
(:goal
(and
    (HasAngle angle60 link1)
    (HasAngle angle140 link2)
    (HasAngle angle60 link3)
    (HasAngle angle120 link4)
    (HasAngle angle160 link5)
    )
)
)

; plan
1. (decrease_angle link1 angle120 angle100)
   deleted: (hasangle angle120 link1) (hasangle angle220 link2) (hasangle angle140 link3) (hasangle angle300 link4) (hasangle angle320 link5)
   added: (hasangle angle100 link1) (hasangle angle200 link2) (hasangle angle120 link3) (hasangle angle280 link4) (hasangle angle300 link5)
   goals met: 0 of 5
2. (decrease_angle link1 angle100 angle80)
   deleted: (hasangle angle100 link1) (hasangle angle200 link2) (hasangle angle120 link3) (hasangle angle280 link4) (hasangle angle300 link5)
   added: (hasangle angle80 link1) (hasangle angle180 link2) (hasangle angle100 link3) (hasangle angle260 link4) (hasangle angle280 link5)
   goals met: 0 of 5
3. (decrease_angle link1 angle80 angle60)
   deleted: (hasangle angle80 link1) (hasangle angle180 link2) (hasangle angle100 link3) (hasangle angle260 link4) (hasangle angle280 link5)
   added: (hasangle angle60 link1) (hasangle angle160 link2) (hasangle angle80 link3) (hasangle angle240 link4) (hasangle angle260 link5)
   goals met: 1 of 5
4. (decrease_angle link2 angle160 angle140)
   deleted: (hasangle angle160 link2) (hasangle angle80 link3) (hasangle angle240 link4) (hasangle angle260 link5)
   added: (hasangle angle140 link2) (hasangle angle60 link3) (hasangle angle220 link4) (hasangle angle240 link5)
   goals met: 3 of 5
5. (decrease_angle link3 angle60 angle40)
   deleted: (hasangle angle60 link3) (hasangle angle220 link4) (hasangle angle240 link5)
   added: (hasangle angle40 link3) (hasangle angle200 link4) (hasangle angle220 link5)
   goals met: 2 of 5
6. (decrease_angle link1 angle60 angle40)
   deleted: (hasangle angle60 link1) (hasangle angle140 link2) (hasangle angle40 link3) (hasangle angle200 link4) (hasangle angle220 link5)
   added: (hasangle angle40 link1) (hasangle angle120 link2) (hasangle angle20 link3) (hasangle angle180 link4) (hasangle angle200 link5)
   goals met: 0 of 5
7. (increase_angle link2 angle120 angle140)
   deleted: (hasangle angle120 link2) (hasangle angle20 link3) (hasangle angle180 link4) (hasangle angle200 link5)
   added: (hasangle angle140 link2) (hasangle angle40 link3) (hasangle angle200 link4) (hasangle angle220 link5)
   goals met: 1 of 5
8. (increase_angle link3 angle40 angle60)
   deleted: (hasangle angle40 link3) (hasangle angle200 link4) (hasangle angle220 link5)
   added: (hasangle angle60 link3) (hasangle angle220 link4) (hasangle angle240 link5)
   goals met: 2 of 5
9. (decrease_angle link4 angle220 angle200)
   deleted: (hasangle angle220 link4) (hasangle angle240 link5)
   added: (hasangle angle200 link4) (hasangle angle220 link5)
   goals met: 2 of 5
10. (decrease_angle link4 angle200 angle180)
   deleted: (hasangle angle200 link4) (hasangle angle220 link5)
   added: (hasangle angle180 link4) (hasangle angle200 link5)
   goals met: 2 of 5
11. (decrease_angle link4 angle180 angle160)
   deleted: (hasangle angle180 link4) (hasangle angle200 link5)
   added: (hasangle angle160 link4) (hasangle angle180 link5)
   goals met: 2 of 5
12. (decrease_angle link4 angle160 angle140)
   deleted: (hasangle angle160 link4) (hasangle angle180 link5)
   added: (hasangle angle140 link4) (hasangle angle160 link5)
   goals met: 3 of 5
13. (increase_angle link5 angle160 angle180)
   deleted: (hasangle angle160 link5)
   added: (hasangle angle180 link5)
   goals met: 2 of 5
14. (decrease_angle link4 angle140 angle120)
   deleted: (hasangle angle140 link4) (hasangle angle180 link5)
   added: (hasangle angle120 link4) (hasangle angle160 link5)
   goals met: 4 of 5
15. (increase_angle link5 angle160 angle180)
   deleted: (hasangle angle160 link5)
   added: (hasangle angle180 link5)
   goals met: 3 of 5
16. (increase_angle link1 angle40 angle60)
   deleted: (hasangle angle40 link1) (hasangle angle140 link2) (hasangle angle60 link3) (hasangle angle120 link4) (hasangle angle180 link5)
   added: (hasangle angle60 link1) (hasangle angle160 link2) (hasangle angle80 link3) (hasangle angle140 link4) (hasangle angle200 link5)
   goals met: 1 of 5
17. (decrease_angle link2 angle160 angle140)
   deleted: (hasangle angle160 link2) (hasangle angle80 link3) (hasangle angle140 link4) (hasangle angle200 link5)
   added: (hasangle angle140 link2) (hasangle angle60 link3) (hasangle angle120 link4) (hasangle angle180 link5)
   goals met: 4 of 5
18. (decrease_angle link5 angle180 angle160)
   deleted: (hasangle angle180 link5)
   added: (hasangle angle160 link5)
   goals met: 5 of 5
